manual = {
    {
        button="1、游戏的进行方式",
        title = "游戏的进行方式",
        texts = 
        {
            "    躲避子弹，清理道中莫名就出来拦截的妖精，直到关底会有一",
            "个Boss，把她击败，游戏就通关了。",
            "    总的来说就是尽量不中弹，直到通关。",
        }
    },

    {
        button="2.1、前情提要(p1)",
        title = "前情提要(p1)",
        texts = 
        {
            "    平静的幻想乡。",
            "    上次异变，是什么时候呢？",
            "    最近真是平静啊——没有异变的平常的每一天，潮湿炎热的夏",
            "天午后，一如既往在神社里喝茶的灵梦这样想。",
            "    “倒也不是坏事”。灵梦呼出一口气，然后就这样躺了下去。",
            " ",
            "    一阵急促的脚步传来，接着神社的门被拉开了。“灵梦！今天",
            "也是好天气呢！”",
            "    早苗兴冲冲走进神社：“今天晚上会有异变，你一定要来。”",
            "    “什么嘛，异变什么的，不都是你第一个去收集信仰吗？”",
            "    “不行不行，这次异变只有咱博丽的巫女才能解决的说。”",
            "    “不要，好麻烦……”",
            "    “总之今天晚上异变解决靠你了！”。留下最后一句话后，早",
            "苗偷笑着又是小跑走了。"
        }
    },

    {
        button="2.2、前情提要(p2)",
        title = "前情提要(p2)",
        texts = 
        {
            "    灵梦又躺了一会。",
            "    “今天确实天气不错”",
            "    “异变吗，晚上……”",
            " ",
            "    晚上了。天气依然好极了。透过澄澈的天空，数以亿计的星星",
            "和星光汇聚的整条银河就这样全部呈现在眼前，让人觉得中间连空",
            "气都没有，忘记正站在大地上抬头仰望星空。",
            "    一颗流星划过，然后是第二颗，第三颗。",
            "    好多流星划过夜空。",
            "    只是看到了流星，莫名就产生了非常怀念的感觉。至少灵梦是",
            "这种感受。",
            "    想到去年还是前年，好像正好洛薰和洛黛来到幻想乡。当然还",
            "有那个星神。",
            "    当时还飞到了那么高的地方，不过确实星星很漂亮。灵梦不自",
            "就想起了那天。"
        }
    },

    {
        button="2.3、前情提要(p3)",
        title = "前情提要(p3)",
        texts = 
        {
            "    回过神来。",
            "    “不对，所以现在果然是异变吗”",
            "    于是灵梦朝着流星的方向出发。"
        }
    },

    {
        button="3、游戏的操作",
        title = "游戏的操作",
        texts = 
        {
            "↑ ↓ ← → ：自机移动",
            "Z ：射击",
            "X ：符卡（有次数限制）,伤害高且可以消弹",
            "Shift ：按下时低速移动并显示自机判定点"
        }
    },

    {
        button="4、游戏界面",
        title = "游戏界面",
        texts = 
        {
            "（以下按照游戏界面自上而下的排列顺序说明）",
            " ",
            "HighScore：历史最高得分",
            "Score：本次游戏得分",
            "Player：剩余可以中弹的次数",
            "Spell：剩余可使用符卡的次数",
            "Power：自机的火力。每达到100火力将为自机增加一个子机，上限",
            "       400火力",
            "Graze：擦过敌弹的数量",
            " ",
            "FPS：游戏的刷新率。一般稳定在59~60。边听歌边玩可能会掉帧",
            "Effect Num：屏幕中的特效数量",
            "Bullet Num：屏幕中的子弹数量"
        }
    },

    {
        button="5、掉落道具",
        title = "掉落道具",
        texts = 
        {
            "移动到画面上1/3处可以以最大得分收取屏幕中所有道具！",
            " ",
            "点(蓝)：增加本次游戏得分。在高处拾取有更高得分。",
            "P ：增加自机火力。",
        }
    },

    {
        button="6、自机性能",
        title = "自机性能",
        texts = 
        {
            "高速时：子机集中射击，发射高速直线札弹",
            "低速时：子机诱导射击，发射全局追踪符纸",
            "符卡：召唤八颗环绕自身的灵弹，然后射出造成范围伤害",
            " ",
            "自机判定点较小（所以为什么会有这一句话呢）"
        }
    },

    {
        button="7、ending",
        title = "ending",
        texts = 
        {
            "    发起异变的和解决异变的二人躺在山坡上望着尚且还是满天星",
            "辰的东边。",
            "    “所以，就为了再看一次这个发动了异变吗”",
            "    “啊啊不行吗。你不也很开心吗”",
            "    “……”",
            "    “银河出来的时候你可是恍惚得差点mis……”",
            "    “哪有！！”",
            "    有一句没一句的间隙中，天色渐渐破晓，接着是清晨的第一缕",
            "阳光。",
            "    是第二天到来了，也是这个流星的幻想夏夜结束了。",
            "    不过没关系的吧。时间还长，想必之后也不缺像这次这样的事",
            "    “好吧，这样的异变至少不讨厌”",
            "    “身为巫女怎么能站在异变的一方！！！”",
            "    “你这家伙！”",
            "    平静的幻想乡，又一天。"
        }
    }
}