manual = {
    {
        button="1、游戏的进行方式",
        title = "游戏的进行方式",
        texts = 
        {
            "    躲避子弹，清理道中莫名就出来拦截的妖精，直到关底会有一",
            "个Boss，把她击败，游戏就通关了。",
            "    总的来说就是尽量不中弹，直到通关。",
            "    好好享受弹幕的幻想吧。"
        }
    },

    {
        button="2.1、前情提要(p1)",
        title = "前情提要(p1)",
        texts = 
        {
            "    平静的幻想乡。",
            "    上次异变，是什么时候呢？",
            "    最近真是平静啊——没有异变的平常的每一天，潮湿炎热的夏",
            "天午后，一如既往在神社里喝茶的灵梦这样想。",
            "    “倒也不是坏事”。灵梦呼出一口气，然后就这样躺了下去。",
            " ",
            "    一阵急促的脚步传来，接着神社的门被拉开了。“灵梦！今天",
            "也是好天气呢！”",
            "    早苗兴冲冲走进神社：“今天晚上会有异变，你一定要来。”",
            "    “什么嘛，异变什么的，不都是你第一个去收集信仰吗？”",
            "    “不行不行，这次异变只有咱博丽的巫女才能解决的说。”",
            "    “不要，好麻烦……”",
            "    “总之今天晚上异变解决靠你了！”。留下最后一句话后，早",
            "苗偷笑着又是小跑走了。"
        }
    },

    {
        button="2.2、前情提要(p2)",
        title = "前情提要(p2)",
        texts = 
        {
            "    灵梦又躺了一会。",
            "    “今天确实天气不错”",
            "    “异变吗，晚上……”",
            " ",
            "    晚上了。天气依然好极了。透过澄澈的天空，数以亿计的星星",
            "和星光汇聚的整条银河就这样全部呈现在眼前，让人觉得中间连空",
            "气都没有，忘记正站在大地上抬头仰望星空。",
            "    一颗流星划过，然后是第二颗，第三颗。",
            "    好多流星划过夜空。",
            "    只是看到了流星，莫名就产生了非常怀念的感觉。至少灵梦是",
            "这种感受。",
            "    去年还是前年这时候，好像正好洛薰和洛黛来到幻想乡。当然",
            "还有那个星神。",
            "    当时还飞到了那么高的地方，不过确实星星很漂亮。灵梦不自",
            "就想起了那天。"
        }
    },

    {
        button="2.3、前情提要(p3)",
        title = "前情提要(p3)",
        texts = 
        {
            "    回过神来。",
            "    “不对，所以现在果然是异变吗”",
            "    于是灵梦朝着流星的方向出发。"
        }
    },

    {
        button="3、游戏的操作",
        title = "游戏的操作",
        texts = 
        {
            "↑ ↓ ← → ：自机移动",
            "Z ：射击",
            "X ：符卡",
            "Shift ：按下时低速移动并显示自机判定点"
        }
    },

    {
        button="4、游戏界面",
        title = "游戏界面",
        texts = 
        {
            "（暂缺）",
        }
    },

    {
        button="5、掉落道具",
        title = "掉落道具",
        texts = 
        {
            "    点(蓝)：增加本次游戏得分。在高处拾取有更高得分。",
            "    P ：增加自机火力。有少量得分。",
        }
    },

    {
        button="6、自机性能",
        title = "自机性能",
        texts = 
        {
            "博丽灵梦",
            "   高速时高伤害集中射击，低速时诱导射击。",
            "   自机判定点较小。"
        }
    }
}