manual = {
    {
        button="游戏的进行方式",
        title = "1、游戏的进行方式",
        texts = 
        {
            "    躲避子弹，清理道中看见的妖精。然后每一关的",
            "关底有一个Boss，把她击败，这一关就通过了。",
            "    把每一关都通过，游戏就通关了。",
            "    是的，总的来说，就是尽量不中弹，坚持到游戏",
            "通关。"
        }
    },

    {
        button="前情提要",
        title = "2、前情提要",
        texts = 
        {
            "（暂缺）"
        }
    },

    {
        button="游戏的操作",
        title = "3、游戏的操作",
        texts = 
        {
            "↑ ↓ ← → ：控制自机移动",
            "Z ：射击",
            "X ：符卡",
            "Shift ：按下时低速移动并显示自机判定点"
        }
    },

    {
        button="游戏界面",
        title = "4、游戏界面",
        texts = 
        {
            "3、游戏的操作",
            "↑ ↓ ← → ：控制移动",
            "Z ：射击",
            "X ：符卡",
            "Shift ：低速移动"
        }
    },

    {
        button="掉落道具",
        title = "5、掉落道具",
        texts = 
        {
            "    点(蓝)：拾取后增加本次游戏得分。拾取位置越高",
            "，得分越高。在界面上1/3及以上拾取可",
            "以得到最高得分 ",
            "    P ：拾取后增加自机火力。有少量拾取得分",
        }
    },

    {
        button="自机性能",
        title = "6、自机性能",
        texts = 
        {
            "3、游戏的操作",
            "↑ ↓ ← → ：控制移动",
            "Z ：射击",
            "X ：符卡",
            "Shift ：低速移动"
        }
    }
}

button=
{
    "游戏的进行方式",
    "前情提要",
    "游戏的操作",
    "游戏界面",
    "掉落道具",
    "自机性能"
}