manual = {
    {
        button="游戏的进行方式",
        title = "1、游戏的进行方式",
        texts = 
        {
            "    躲避看起来被打到会很痛的子弹，顺手清理",
            "道中的各种小怪。然后每一关的关底有一个Boss，",
            "把她击败，这一关就过了。",
            "    把每一关都通过，游戏就通关了。",
            "    是的，总的来说，就是尽量不中弹，坚持到",
            "游戏通关。"
        }
    },

    {
        button="前情提要",
        title = "2、前情提要",
        texts = 
        {
            "（暂缺）"
        }
    },

    {
        button="游戏的操作",
        title = "3、游戏的操作",
        texts = 
        {
            "↑ ↓ ← → ：自机移动",
            "Z ：射击",
            "X ：符卡",
            "Shift ：按下时低速移动并显示自机判定点"
        }
    },

    {
        button="游戏界面",
        title = "4、游戏界面",
        texts = 
        {
            "（暂缺）"
        }
    },

    {
        button="掉落道具",
        title = "5、掉落道具",
        texts = 
        {
            "    点(蓝)：增加本次游戏得分。在高处拾取有",
            "更高得分。",
            "    P ：增加自机火力。有少量得分。",
        }
    },

    {
        button="自机性能",
        title = "6、自机性能",
        texts = 
        {
            "博丽灵梦",
            "   高速时高伤害集中射击，低速时诱导射击。",
            "   自机判定点较小。"
        }
    }
}